#+startup: beamer
#+title: Advanced mixed-models workshop: Session 1
#+author: Dale Barr
#+email: dale.barr@glasgow.ac.uk
#+date: Bremen March 2015
#+OPTIONS: toc:nil H:2 ^:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: []
#+BEAMER_THEME: Boadilla
#+LATEX_HEADER: \makeatletter \def\verbatim{\scriptsize\@verbatim \frenchspacing\@vobeyspaces \@xverbatim} \makeatother

#+BEAMER_COLOR_THEME: seahorse
#+LATEX_HEADER: \definecolor{lgray}{rgb}{0.90,0.90,0.90}
#+LATEX_HEADER: \beamertemplatenavigationsymbolsempty
#+LATEX_HEADER: \usemintedstyle{tango}
#+LATEX_HEADER: \institute{University of Glasgow}

#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+PROPERTY: header-args:R :session *R* :exports both :results output verbatim :tangle session_01.R

** By-item random effects

#+BEGIN_SRC R
  ## define item random effects variance
  ## and sample items
  item$iri <- rnorm(nitem, mean = 0, sd = iri)

  ## view the expected mean for each item
  ## for a typical subject (random effs = 0)
  head(cbind(mu, effc[item$cond] * eff, item$iri,
             mu + effc[item$cond] * eff + item$iri), 3)
#+END_SRC

#+RESULTS:
: Error in rnorm(nitem, mean = 0, sd = iri) : object 'nitem' not found
:  Error in cbind(mu, effc[item$cond] * eff, item$iri, mu + effc[item$cond] *  : 
:   object 'mu' not found

** Decomposition matrix

#+BEGIN_CENTER
\(Y_{si} = \beta_0 + S_{0s} + I_{0i} + (\beta_1 + S_{1s})X_{i} + e_{si}\)
#+END_CENTER

#+BEGIN_SRC R :exports results :tangle junk.R
  suppressPackageStartupMessages(library("dplyr"))
  dat %>%
      mutate(mu = mu, eff = eff, x = effc[cond]) %>%
      select(sid = subject_id, iid = item_id, c = cond, 
             Y, mu, sri, iri, eff, srs, x, err) %>%
      filter(sid < 5) %>%
      group_by(sid, c) %>%
      slice(1:2) %>% ungroup()
#+END_SRC

#+RESULTS:
#+begin_example
 Source: local data frame [64 x 11]
Groups: sid, c

   sid iid c        Y  mu        sri        iri eff       srs    x        err
1    1   1 1 866.6973 800 -127.33939   51.14385  80 -15.07568 -0.5  175.35504
2    1   2 1 520.0347 800 -127.33939  -87.15511  80 -15.07568 -0.5  -33.00861
3    1  13 2 921.6896 800 -127.33939 -104.37196  80 -15.07568  0.5  320.93881
4    1  14 2 711.8382 800 -127.33939 -124.47164  80 -15.07568  0.5  131.18702
5    2   1 1 700.6971 800   38.40241   51.14385  80 -20.38240 -0.5 -159.04036
6    2   2 1 560.1265 800   38.40241  -87.15511  80 -20.38240 -0.5 -161.31203
7    2  13 2 280.5352 800   38.40241 -104.37196  80 -20.38240  0.5 -483.30409
8    2  14 2 479.3219 800   38.40241 -124.47164  80 -20.38240  0.5 -264.41768
9    3   1 1 695.3036 800  -12.51718   51.14385  80  14.50942 -0.5  -96.06837
10   3   2 1 773.5395 800  -12.51718  -87.15511  80  14.50942 -0.5  120.46647
.. ... ... .      ... ...        ...        ... ...       ...  ...        ...
#+end_example

** Viewing results

#+BEGIN_SRC R :exports results 
  summary(mod)
#+END_SRC

#+RESULTS:
#+begin_example
Linear mixed model fit by maximum likelihood  ['lmerMod']
Formula: Y ~ c + (1 + c | subject_id) + (1 | item_id)
   Data: dat

     AIC      BIC   logLik deviance df.resid 
  5179.5   5207.2  -2582.8   5165.5      377 

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-2.7280 -0.5511 -0.0343  0.6103  3.3860 

Random effects:
 Groups     Name        Variance Std.Dev. Corr 
 item_id    (Intercept)  8792.4   93.768       
 subject_id (Intercept) 11434.8  106.934       
            c              95.5    9.772  -1.00
 Residual               33590.6  183.278       
Number of obs: 384, groups:  item_id, 24; subject_id, 16

Fixed effects:
            Estimate Std. Error t value
(Intercept)   779.44      34.18  22.802
c              46.36      42.68   1.086

Correlation of Fixed Effects:
  (Intr)
c -0.045
#+end_example
